export default {
  name: 'DRLogo',
  render () {
    return <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 363 293" preserveAspectRatio="none" width="32" height="32">
      <title>5eaa3955e5940</title>
      <g id="图层_3" data-name="图层 3">
        <path d="M362.45,171.27S196.17,272.33,46.38,208.54c-53-22.93,1.43-177,122.56-177,70.59-2.33,52.85,57.87,7.7,77.22L222.05,228l46.77-11.29-43.26-76.26s93-38.47,47.3-109S55.7,25.42,10,144.75s95,181.74,271.45,125.79c0,0-52.83,8.65-64.51,2.86,0,0,78.33-5.68,132.44-67.67,0,0-97.68,58-164.33,52.26C185.06,258,321.51,235.47,362.45,171.27Z" fill="currentColor" yFill="currentColor">
        </path>
      </g>
      <g transform="translate(80, 70) scale(0.5) ">
        <path d="M90.69,14.9C60.69,27.41,26.2,49.3,1.84,89.39c0,0,108.47-74.72,94.69-22.19L40.84,296.07h72.34L178,54.71a42.32,42.32,0,0,0-15-44.56C141.64-3,104.53,9.13,90.69,14.9Z" fill="currentColor" yFill="currentColor"></path>
      </g>
    </svg>
  }
}
